bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32l_defs.c
 * @brief YARD-ICE
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#if defined(STM32L1XX)

#define STM32F_BASE_FSMC    0xa0000000
#define STM32F_BASE_AES     0x50060000
#define STM32F_BASE_DMA2    0x40026400
#define STM32F_BASE_DMA1    0x40026000
#define STM32F_BASE_FLASH   0x40023c00
#define STM32F_BASE_RCC     0x40023800
#define STM32F_BASE_CRC     0x40023000
#define STM32F_BASE_GPIOG   0x40021c00
#define STM32F_BASE_GPIOF   0x40021800
#define STM32F_BASE_GPIOH   0x40021400
#define STM32F_BASE_GPIOE   0x40021000
#define STM32F_BASE_GPIOD   0x40020c00
#define STM32F_BASE_GPIOC   0x40020800
#define STM32F_BASE_GPIOB   0x40020400
#define STM32F_BASE_GPIOA   0x40020000
#define STM32F_BASE_USART1  0x40013800
#define STM32F_BASE_SPI1    0x40013000
#define STM32F_BASE_SDIO    0x40012c00
#define STM32F_BASE_ADC     0x40012400
#define STM32F_BASE_TIM11   0x40011000
#define STM32F_BASE_TIM10   0x40010c00
#define STM32F_BASE_TIM9    0x40010800
#define STM32F_BASE_EXTI    0x40010400
#define STM32F_BASE_SYSCFG  0x40010000
#define STM32F_BASE_OPAMP   0x40007c5c
#define STM32F_BASE_RI      0x40007c04
#define STM32F_BASE_COMP    0x40007c00
#define STM32F_BASE_DAC     0x40007400
#define STM32F_BASE_PWR     0x40007000
#define STM32F_BASE_USB_FS  0x40005c00
#define STM32F_BASE_I2C2    0x40005800
#define STM32F_BASE_I2C1    0x40005400
#define STM32F_BASE_UART5   0x40005000
#define STM32F_BASE_UART4   0x40004c00
#define STM32F_BASE_USART3  0x40004800
#define STM32F_BASE_USART2  0x40004400
#define STM32F_BASE_SPI3    0x40003c00
#define STM32F_BASE_SPI2    0x40003800
#define STM32F_BASE_IWDG    0x40003000
#define STM32F_BASE_WWDG    0x40002c00
#define STM32F_BASE_RTC     0x40002800
#define STM32F_BASE_LCD     0x40002400
#define STM32F_BASE_TIM7    0x40001400
#define STM32F_BASE_TIM6    0x40001000
#define STM32F_BASE_TIM5    0x40000c00
#define STM32F_BASE_TIM4    0x40000800
#define STM32F_BASE_TIM3    0x40000400
#define STM32F_BASE_TIM2    0x40000000

#else 
#error "STM32L family undefined or invalid!"
#endif 


/*-------------------------------------------------------------------------
  Power Control (PWR)
  -------------------------------------------------------------------------*/

/* PWR power control register */
#define PWR_CR 0x00 

/* Low power run mode */
#define LPRUN (1 << 10)
/* When LPRUN bit is set together with the LPSDSR bit, the regulator 
   is switched from main mode to low power mode. Otherwise, it remains 
   in main mode. The regulator goes back to operate in main mode when 
   LPRUN is reset.
   It is forbidden to reset LPSDSR when the MCU is in Low power run 
   mode. LPSDSR is used as a prepositioning for the entry into low power 
   mode, indicating to the system which configuration of the regulator 
   will be selected when entering Low power mode. The LPSDSR bit must be 
   set before the LPRUN bit is set. LPSDSR can be reset only when LPRUN bit=0.
   0: Voltage regulator in main mode in Low power run mode
   1: Voltage regulator in low power mode in Low power run mode */

/* Voltage scaling range selection */
#define VOS      (3 << 11)
#define VOS_1_8V (1 << 11)
#define VOS_1_5V (2 << 11)
#define VOS_1_2V (3 << 11)
/* These bits are used to select the internal regulator voltage range.
   Before resetting the power interface by resetting the PWRRST bit in 
   the RCC_APB1RSTR register, these bits have to be set to "10" and the 
   frequency of the system has to be configured accordingly.
   00: forbidden (bits are unchanged and keep the previous value, no 
   voltage scaling range changed)
   01: 1.8 V (range 1)
   10: 1.5 V (range 2)
   11: 1.2 V (range 3) */


/* Fast wakeup */
#define FWU (1 << 10)
/* This bit works in conjunction with ULP bit.
   If ULP = 0, FWU is ignored
   If ULP = 1 and FWU = 1: V REFINT startup time is ignored when 
   exiting from low power mode.
   The VREFINTRDYF flag in the CSR register indicates when the 
   V REFINT is ready again.
   If ULP=1 and FWU = 0: Exiting from low power mode occurs only when 
   the V REFINT is ready (after its startup time). This bit is not reset 
   by resetting the PWRRST bit in the
   RCC_APB1RSTR register.
   0: Low power modes exit occurs only when V REFTINT is ready
   1: V REFTINT start up time is ignored when exiting low power modes */


/* Ultralow power mode */
#define ULP (1 << 9)
/* When set, the V REFINT is switched off in low power mode. This bit is 
   not reset by resetting the PWRRST bit in the RCC_APB1RSTR register.
   0: V REFTINT is on in low power mode
   1: V REFTINT is off in low power mode */

/* Disable backup write protection */
#define DBP (1 << 8)
/* In reset state, the RTC, RTC backup registers and RCC CSR register 
   are protected against parasitic write access. This bit must be set 
   to enable write access to these registers.
0: Access to RTC, RTC Backup and RCC CSR registers disabled
1: Access to RTC, RTC Backup and RCC CSR registers enabled
Note: If the HSE divided by 2, 4, 8 or 16 is used as the RTC clock, this bit must remain set to 1. */


/* PVD level selection. */
#define PLS (0x7 << 5)
#define PLS_1_9V (0x0 << 5)
#define PLS_2_1V (0x1 << 5)
#define PLS_2_3V (0x2 << 5)
#define PLS_2_5V (0x3 << 5)
#define PLS_2_7V (0x4 << 5)
#define PLS_2_9V (0x5 << 5)
#define PLS_3_1V (0x6 << 5)
#define PLS_EXT  (0x7 << 5)
/* These bits are written by software to select the voltage threshold detected 
   by the Power Voltage Detector
	000: 1.9 V
	001: 2.1 V
	010: 2.3 V
	011: 2.5 V
	100: 2.7 V
	101: 2.9 V
	110: 3.1 V
    111: External input analog voltage (Compare internally to V REFINT)
	PVD_IN input (PB7) has to be configured as analog input 
	when PLS[2:0] = 111. 
    Note: Refer to the electrical characteristics of the datasheet for 
	more details. */

/* Power voltage detector enable */
#define PVDE (1 << 4)
/* This bit is set and cleared by software.
0: PVD disabled
1: PVD enabled */

