bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
/* Clear standby flag */
#define CSBF (1 << 3)
/* This bit is always read as 0.
0: No effect
1: Clear the SBF Standby Flag (write). */

/* Clear wakeup flag */
#define CWUF (1 << 2)
/* This bit is always read as 0.
0: No effect
1: Clear the WUF Wakeup Flag after 2 System clock cycles */

/* Power down deepsleep. */
#define PDDS (1 << 1)
/* This bit is set and cleared by software. 
   It works together with the LPDS bit. 
0: Enter Stop mode when the CPU enters deepsleep. 
	The regulator status depends on the LPDS bit.
1: Enter Standby mode when the CPU enters deepsleep. */

/* Low-power deepsleep/sleep/low power run */
#define LPSDSR (1 << 0)
/* – DeepSleep/Sleep modes
When this bit is set, the regulator switches in low power mode when the CPU enters sleep or
deepsleep mode. The regulator goes back to main mode when the CPU exits from these
modes.
– Low power run mode
When this bit is set, the regulator switches in low power mode when the bit LPRUN is set.
The regulator goes back to main mode when the bit LPRUN is reset.
This bit is set and cleared by software.
0: Voltage regulator on during deepsleep/Sleep/Low power run mode
1: Voltage regulator in low power mode during deepsleep/Sleep/Low power run mode */


/* PWR power control/status register */
#define PWR_CSR 0x04

/* Enable WKUP pin 3 */
#define EWUP3 (1 << 10)
/* This bit is set and cleared by software.
   0: WKUP pin 3 is used for general purpose I/Os. An event on the WKUP 
   pin 3 does not wakeup the device from Standby mode.
   1: WKUP pin 3 is used for wakeup from Standby mode and forced in input 
   pull down configuration (rising edge on WKUP pin 3 wakes-up the system 
   from Standby mode).
   Note: This bit is reset by a system reset. */

/* Enable WKUP pin 2 */
#define EWUP2 (1 << 9)
/* This bit is set and cleared by software.
   0: WKUP pin 2 is used for general purpose I/Os. An event on the WKUP pin 
   2 does not wakeup the device from Standby mode.
   1: WKUP pin 2 is used for wakeup from Standby mode and forced in input 
   pull down configuration (rising edge on WKUP pin 2 wakes-up the system 
   from Standby mode).
   Note: This bit is reset by a system reset. */

/* Enable WKUP pin 1 */
#define EWUP1 (1 << 8)
/* This bit is set and cleared by software.
0: WKUP pin 1 is used for general purpose I/Os. An event on the WKUP pin 1 does not
wakeup the device from Standby mode.
1: WKUP pin 1 is used for wakeup from Standby mode and forced in input pull down
configuration (rising edge on WKUP pin 1 wakes-up the system from Standby mode).
Note: This bit is reset by a system reset. */


/* Regulator LP flag */
#define REGLPF (1 << 5)
/* This bit is set by hardware when the MCU is in Low power run mode.
When the MCU exits from Low power run mode, this bit stays at 1 until the regulator is ready in
main mode. A polling on this bit is recommended to wait for the regulator main mode. This bit is
reset by hardware when the regulator is ready.
0: Regulator is ready in main mode
1: Regulator voltage is in low power mode */

/* Voltage Scaling select flag */
#define VOSF (1 << 4)
/* A delay is required for the internal regulator to be ready after the voltage range is changed.
The VOSF bit indicates that the regulator has reached the voltage level defined with bits VOS
of CR register.
This bit is reset when VOS[1:0] in CR register change.
It is set once the regulator is ready.
0: Regulator is ready in the selected voltage range
1: Regulator voltage output is changing to the required VOS level. */

/* VREFINTRDYF: Internal voltage reference (V REFINT ) ready flag */
#define VREFINTRDYF (1 << 3)
/* This bit indicates the state of the internal voltage reference, V REFINT .
0: V REFINT is OFF
1: V REFINT is ready */

/* PVD output */
#define PVDO (1 << 2)
/* This bit is set and cleared by hardware. It is valid only if PVD is 
   enabled by the PVDE bit.
0: VDD/VDDA is higher than the PVD threshold selected with the PLS[2:0] bits.
1: VDD/VDDA is lower than the PVD threshold selected with the PLS[2:0] bits.
Note: The PVD is stopped by Standby mode. For this reason, this bit is 
equal to 0 after Standby or reset until the PVDE bit is set. */

/* Standby flag */
#define SBF (1 << 1)
/* This bit is set by hardware and cleared only by a POR/PDR (power-on 
   reset/power-down reset) or by setting the CSBF bit in the PWR power 
   control register (CR)
0: Device has not been in Standby mode
1: Device has been in Standby mode */

/* Wakeup flag */
#define WUF (1 << 0)
/* This bit is set by hardware and cleared only by a POR/PDR (power-on 
   reset/power-down reset) or by setting the CWUF bit in the PWR power 
   control register (CR)
0: No wakeup event occurred
1: A wakeup event was received from the WKUP pin or from the RTC alarm 
(Alarm A or Alarm B), RTC Tamper event, RTC TimeStamp event or RTC Wakeup).
Note: An additional wakeup event is detected if the WKUP pin is enabled 
(by setting the EWUP bit) when the WKUP pin level is already high. */



/*-------------------------------------------------------------------------
  System configuration controller
  -------------------------------------------------------------------------*/

/* Compensation cell control register */
#define SYSCFG_CMPCR 0x20

#define CMP_PD (1 << 0)
/* Compensation cell power-down
0: I/O compensation cell power-down mode
1: I/O compensation cell enabled */


/*-------------------------------------------------------------------------
  RCC
  -------------------------------------------------------------------------*/

/* ------------------------------------------------------------------------- */
/* RCC clock control register */ 
#define RCC_CR 0x00

#define RTC_PRE (0x3 << 29)

#define RTC_PRE_HSE_2 (0x0 << 29)
#define RTC_PRE_HSE_4 (0x1 << 29)
#define RTC_PRE_HSE_8 (0x2 << 29)
#define RTC_PRE_HSE_16 (0x3 << 29)
/* RTC/LCD prescaler
   These bits are set and reset by software to obtain a 1 MHz clock from HSE. 
   This prescaler cannot be modified if HSE is enabled (HSEON = 1).
   These bits are reset by power on reset, they keep their value after system 
   reset.
   00: HSE is divided by 2 for RTC/LCD clock
   01: HSE is divided by 4 for RTC/LCD clock
   10: HSE is divided by 8 for RTC/LCD clock
   11: HSE is divided by 16 for RTC/LCD clock
 */

#define PLLI2SRDY (1 << 27)
/* PLLI2S clock ready flag
   Set by hardware to indicate that the PLLI2S is locked.
0: PLLI2S unlocked
1: PLLI2S locked*/

