bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
#define PLLI2SON (1 << 26)
/* PLLI2S enable
   Set and cleared by software to enable PLLI2S.
   Cleared by hardware when entering Stop or Standby mode.
0: PLLI2S OFF
1: PLLI2S ON*/

#define PLLRDY (1 << 25)
/* Main PLL (PLL) clock ready flag
   Set by hardware to indicate that PLL is locked.
0: PLL unlocked
1: PLL locked*/

#define PLLON (1 << 24)
/* Main PLL (PLL) enable
   Set and cleared by software to enable PLL.
   Cleared by hardware when entering Stop or Standby mode. This bit cannot be reset if PLL
   clock is used as the system clock.
0: PLL OFF
1: PLL ON
 */

#define CSSON (1 << 19)
/* Clock security system enable
   Set and cleared by software to enable the clock security system. When CSSON is set, the
   clock detector is enabled by hardware when the HSE oscillator is ready, and disabled by
   hardware if an oscillator failure is detected.
0: Clock security system OFF (Clock detector OFF)
1: Clock security system ON (Clock detector ON if HSE oscillator is stable, OFF if not)*/

#define HSEBYP (1 << 18)
/* HSE clock bypass
   Set and cleared by software to bypass the oscillator with an external clock. The external
   clock must be enabled with the HSEON bit, to be used by the device.
   The HSEBYP bit can be written only if the HSE oscillator is disabled.
0: HSE oscillator not bypassed
1: HSE oscillator bypassed with an external clock*/

#define HSERDY (1 << 17)
/* HSE clock ready flag
   Set by hardware to indicate that the HSE oscillator is stable. After the HSION bit is cleared,
   HSERDY goes low after 6 HSE oscillator clock cycles.
0: HSE oscillator not ready
1: HSE oscillator ready*/

#define HSEON (1 << 16)
/* HSE clock enable
   Set and cleared by software.
   Cleared by hardware to stop the HSE oscillator when entering Stop or Standby mode. This
   bit cannot be reset if the HSE oscillator is used directly or indirectly as the system clock.
0: HSE oscillator OFF
1: HSE oscillator ON*/

#define MSIRDY (1 << 9)
/* MSI clock ready flag
   This bit is set by hardware to indicate that the MSI oscillator is stable.
0: MSI oscillator not ready
1: MSI oscillator ready  */

#define MSION (1 << 8)
/* MSI clock enable
   This bit is set and cleared by software.
   Set by hardware to force the MSI oscillator ON when exiting from Stop 
   or Standby mode, or in case of a failure of the HSE oscillator used 
   directly or indirectly as system clock. This bit cannot be cleared if the 
   MSI is used as system clock.
 */

#define HSICAL (1 << 8)
/* Internal high-speed clock calibration
   These bits are initialized automatically at startup.*/

#define HSITRIM (1 << 3)
/* Internal high-speed clock trimming
   These bits provide an additional user-programmable trimming value that is 
   added to the HSICAL[7:0] bits. It can be programmed to adjust to 
   variations in voltage and temperature that influence the frequency of 
   the internal HSI RC. */

/* Bit 2 Reserved, always read as 0.*/

#define HSIRDY (1 << 1)
/* Internal high-speed clock ready flag
   Set by hardware to indicate that the HSI oscillator is stable. After the HSION bit is cleared,
   HSIRDY goes low after 6 HSI clock cycles.
0: HSI oscillator not ready
1: HSI oscillator ready*/
#define HSION (1 << 0)
/* Internal high-speed clock enable
   Set and cleared by software.
   Set by hardware to force the HSI oscillator ON when leaving the Stop or Standby mode or in
   case of a failure of the HSE oscillator used directly or indirectly as the system clock. This bit
   cannot be cleared if the HSI is used directly or indirectly as the system clock.
0: HSI oscillator OFF
1: HSI oscillator ON
 */



/* ------------------------------------------------------------------------- */
/* RCC clock configuration register */

/* STM32F10x RCC clock configuration register */
#define RCC_CFGR 0x08

#define MCO_SYSCLK (0x1 << 24)
#define MCO_HSI    (0x2 << 24)
#define MCO_MSI    (0x3 << 24)
#define MCO_HSE    (0x4 << 24)
#define MCO_PLL    (0x5 << 24)
#define MCO_LSI    (0x6 << 24)
#define MCO_LSE    (0x7 << 24)

#define PLLDIV_2   (0x1 << 22)
#define PLLDIV_3   (0x2 << 22)
#define PLLDIV_4   (0x3 << 22)

#define PLLMUL_MASK   (0x0f << 18)
#define PLLMUL(M) ((((M) - 2) & 0x0f) << 18)

#define PLLXTPRE      (1 << 17)

#define PLLSRC     (1 << 16)
#define PLLSRC_HSI (0 << 16)
#define PLLSRC_HSE (1 << 16)

#define ADCPRE   (0x3 << 14)
#define ADCPRE_2 (0x0 << 14)
#define ADCPRE_4 (0x1 << 14)
#define ADCPRE_6 (0x2 << 14)
#define ADCPRE_8 (0x3 << 14)

#define PPRE2    (0x7 << 11)
#define PPRE2_1  (0x0 << 11)
#define PPRE2_2  (0x4 << 11)
#define PPRE2_4  (0x5 << 11)
#define PPRE2_8  (0x6 << 11)
#define PPRE2_16 (0x7 << 11)
/* APB high-speed prescaler (APB2) 
   These bits are set and cleared by software to control the division 
   factor of the APB high- speed clock (PCLK2).
0xx: HCLK not divided
100: HCLK divided by 2
101: HCLK divided by 4
110: HCLK divided by 8
111: HCLK divided by 16 */

#define PPRE1    (0x7 << 8)
#define PPRE1_1  (0x0 << 8)
#define PPRE1_2  (0x4 << 8)
#define PPRE1_4  (0x5 << 8)
#define PPRE1_8  (0x6 << 8)
#define PPRE1_16 (0x7 << 8)
/* APB low-speed prescaler (APB1) 
 */

#define HPRE (0xf << 4)
#define HPRE_1 (0x0 << 4)
#define HPRE_2 (0x8 << 4)
#define HPRE_4 (0x9 << 4)
#define HPRE_8 (0xa << 4)
#define HPRE_16 (0xb << 4)
#define HPRE_64 (0xc << 4)
#define HPRE_128 (0xd << 4)
#define HPRE_256 (0xe << 4)
#define HPRE_512 (0xf << 4)
/* AHB prescaler
   Set and cleared by software to control AHB clock division factor.
Caution: The clocks are divided with the new prescaler factor from 
1 to 16 AHB cycles after HPRE write.
Caution: The AHB clock frequency must be at least 25 MHz when the Ethernet 
is used.
0xxx: system clock not divided
1000: system clock divided by 2
1001: system clock divided by 4
1010: system clock divided by 8
1011: system clock divided by 16
1100: system clock divided by 64
1101: system clock divided by 128
1110: system clock divided by 256
1111: system clock divided by 512 */

#define SWS (0x3 << 2)
#define SWS_MSI (0x0 << 2)
#define SWS_HSI (0x1 << 2)
#define SWS_HSE (0x2 << 2)
#define SWS_PLL (0x3 << 2)
/* System clock switch status. Set and cleared by hardware to indicate which 
   clock source is used as the system clock.
00: HSI oscillator used as the system clock
01: HSE oscillator used as the system clock
10: PLL used as the system clock
11: not applicable */

