bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
#define SW (0x3 << 0)
#define SW_MSI (0x0 << 0)
#define SW_HSI (0x1 << 0)
#define SW_HSE (0x2 << 0)
#define SW_PLL (0x3 << 0)

/* System clock switch
   Set and cleared by software to select the system clock source.
   Set by hardware to force the HSI selection when leaving the Stop or Standby mode or in case of failure of the HSE oscillator used directly or indirectly as the system clock.
00: HSI oscillator selected as system clock
01: HSE oscillator selected as system clock
10: PLL selected as system clock
11: not allowed
 */

/* ------------------------------------------------------------------------- */
#define STM32F10_RCC_CIR      (STM32F10_BASE_RCC + 0x08)

/* ------------------------------------------------------------------------- */
/* RCC AHB1 peripheral clock register */
#define RCC_AHB1ENR 0x30

#define OTGHSULPIEN (1 << 30)
/* USB OTG HSULPI clock enable
   Set and cleared by software.
0: USB OTG HS ULPI clock disabled
1: USB OTG HS ULPI clock enabled*/
#define OTGHSEN (1 << 29)
/* USB OTG HS clock enable
   Set and cleared by software.
0: USB OTG HS clock disabled
1: USB OTG HS clock enabled*/
#define ETHMACPTPEN (1 << 28)
/* Ethernet PTP clock enable
   Set and cleared by software.
0: Ethernet PTP clock disabled
1: Ethernet PTP clock enabled*/
#define ETHMACRXEN (1 << 27)
/* Ethernet Reception clock enable
   Set and cleared by software.
0: Ethernet Reception clock disabled
1: Ethernet Reception clock enabled*/
#define ETHMACTXEN (1 << 26)
/* Ethernet Transmission clock enable
   Set and cleared by software.
0: Ethernet Transmission clock disabled
1: Ethernet Transmission clock enabled*/
#define ETHMACEN (1 << 25)
/* Ethernet MAC clock enable
   Set and cleared by software.
0: Ethernet MAC clock disabled
1: Ethernet MAC clock enabled
Bits 24:23
Reserved, always read as 0.*/
#define DMA2EN (1 << 22)
/* DMA2 clock enable
   Set and cleared by software.
0: DMA2 clock disabled
1: DMA2 clock enabled*/
#define DMA1EN (1 << 21)
/* DMA1 clock enable
   Set and cleared by software.
0: DMA1 clock disabled
1: DMA1 clock enabled
Bits 20:19 Reserved, always read as 0.*/
#define BKPSRAMEN (1 << 18)
/* Backup SRAM interface clock enable
   Set and cleared by software.
0: Backup SRAM interface clock disabled
1: Backup SRAM interface clock enabled
Bits 17:13 Reserved, always read as 0.*/
#define CRCEN (1 << 12)
/* CRC clock enable
   Set and cleared by software.
0: CRC clock disabled
1: CRC clock enabled
Bits 11:9 Reserved, always read as 0.*/
#define GPIOIEN (1 << 8)
/* IO port I clock enable
   Set and cleared by software.
0: IO port I clock disabled
1: IO port I clock enabled*/
#define GPIOHEN (1 << 7)
/* IO port H clock enable
   Set and cleared by software.
0: IO port H clock disabled
1: IO port H clock enabled*/
#define GPIOGEN (1 << 6)
/* IO port G clock enable
   Set and cleared by software.
0: IO port G clock disabled
1: IO port G clock enabled*/
#define GPIOFEN (1 << 5)
/* IO port F clock enable
   Set and cleared by software.
0: IO port F clock disabled
1: IO port F clock enabled*/
#define GPIOEEN (1 << 4)
/* IO port E clock enable
   Set and cleared by software.
0: IO port E clock disabled
1: IO port E clock enabled*/
#define GPIODEN (1 << 3)
/* IO port D clock enable
   Set and cleared by software.
0: IO port D clock disabled
1: IO port D clock enabled*/
#define GPIOCEN (1 << 2)
/* IO port C clock enable
   Set and cleared by software.
0: IO port C clock disabled
1: IO port C clock enabled*/
#define GPIOBEN (1 << 1)
/* IO port B clock enable
   Set and cleared by software.
0: IO port B clock disabled
1: IO port B clock enabled*/
#define GPIOAEN (1 << 0)
/* IO port A clock enable
   Set and cleared by software.
0: IO port A clock disabled
1: IO port A clock enabled */

/* RCC Backup domain control register */
#define RCC_BDCR 0x70

#define BDRST (1 << 16)
/* Backup domain software reset
   Set and cleared by software.
0: Reset not activated
1: Resets the entire Backup domain
Note: The BKPSRAM is not affected by this reset, the only way of resetting the BKPSRAM is
through the Flash interface when a protection level change from level 1 to level 0 is
requested. */

#define RTCEN (1 << 15)
/* RTC clock enable
   Set and cleared by software.
0: RTC clock disabled
1: RTC clock enabled
Bits 14:10
Reserved, always read as 0. */

#define RTCSEL (1 << 8)
#define RTCSEL_NONE (0 << 8)
#define RTCSEL_LSE (1 << 8)
#define RTCSEL_LSI (2 << 8)
#define RTCSEL_HSE (3 << 8)
/* RTC clock source selection
   Set by software to select the clock source for the RTC. Once the RTC clock source has been
   selected, it cannot be changed anymore unless the Backup domain is reset. The BDRST bit
   can be used to reset them.
00: No clock
01: LSE oscillator clock used as the RTC clock
10: LSI oscillator clock used as the RTC clock
11: HSE oscillator clock divided by a programmable prescaler (selection through the RTCPRE[4:0] bits in the RCC clock configuration register (RCC_CFGR)) used as the RTC clock */

#define LSEBYP (1 << 2)
/* External low-speed oscillator bypass
   Set and cleared by software to bypass oscillator in debug mode. This bit can be written only
   when the LSE clock is disabled.
0: LSE oscillator not bypassed
1: LSE oscillator bypassed */

#define LSERDY (1 << 1)
/* External low-speed oscillator ready. Set and cleared by hardware to 
   indicate when the external 32 kHz oscillator is stable. 
   After the LSEON bit is cleared, LSERDY goes low after 6 external 
   low-speed oscillator clock cycles.
0: LSE clock not ready
1: LSE clock ready */

#define LSEON (1 << 0)
/* External low-speed oscillator enable
   Set and cleared by software.
0: LSE clock OFF
1: LSE clock ON */

/* RCC clock control & status register */
#define RCC_CSR 0x74

#define LPWRRSTF (1 << 31)
/* Low-power reset flag
   Set by hardware when a Low-power management reset occurs.
   Cleared by writing to the RMVF bit.
0: No Low-power management reset occurred
1: Low-power management reset occurred
For further information on Low-power management reset, 
refer to Low-power management reset. */

#define WWDGRSTF (1 << 30)
/* Window watchdog reset flag
   Set by hardware when a window watchdog reset occurs.
   Cleared by writing to the RMVF bit.
0: No window watchdog reset occurred
1: Window watchdog reset occurred */

#define IWDGRSTF (1 << 29)
/* Independent watchdog reset flag
   Set by hardware when an independent watchdog reset from VDD domain occurs.
   Cleared by writing to the RMVF bit.
0: No watchdog reset occurred
1: Watchdog reset occurred */

#define SFTRSTF (1 << 28)
/* Software reset flag
   Set by hardware when a software reset occurs.
   Cleared by writing to the RMVF bit.
0: No software reset occurred
1: Software reset occurred */

#define PORRSTF (1 << 27)
/* POR/PDR reset flag
   Set by hardware when a POR/PDR reset occurs.
   Cleared by writing to the RMVF bit.
0: No POR/PDR reset occurred
1: POR/PDR reset occurred */

#define PINRSTF (1 << 26)
/* PIN reset flag
   Set by hardware when a reset from the NRST pin occurs.
   Cleared by writing to the RMVF bit.
0: No reset from NRST pin occurred
1: Reset from NRST pin occurred */

#define BORRSTF (1 << 25)
/* BOR reset flag
   Cleared by software by writing the RMVF bit.
   Set by hardware when a POR/PDR or BOR reset occurs.
0: No POR/PDR or BOR reset occurred
1: POR/PDR or BOR reset occurred */

#define RMVF (1 << 24)
/* Remove reset flag
   Set by software to clear the reset flags.
0: No effect
1: Clear the reset flags */

#define LSIRDY (1 << 1)
/* Internal low-speed oscillator ready
   Set and cleared by hardware to indicate when the internal RC 
   40 kHz oscillator is stable.
   After the LSION bit is cleared, LSIRDY goes low after 3 LSI clock cycles.
0: LSI RC oscillator not ready
1: LSI RC oscillator ready */

#define LSION (1 << 0)
/* Internal low-speed oscillator enable
   Set and cleared by software.
0: LSI RC oscillator OFF
1: LSI RC oscillator ON */

/* RCC APB1 peripheral clock enable register */
#define RCC_APB1ENR 0x40

