bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
#define DACEN (1 << 29)
/* DAC interface clock enable
   Set and cleared by software.
0: DAC interface clock disabled
1: DAC interface clock enable */

#define PWREN (1 << 28)
/* Power interface clock enable
   Set and cleared by software.
0: Power interface clock disabled
1: Power interface clock enable */

#define CAN2EN (1 << 26)
/* CAN 2 clock enable
   Set and cleared by software.
0: CAN 2 clock disabled
1: CAN 2 clock enabled */

#define CAN1EN (1 << 25)
/* CAN 1 clock enable
   Set and cleared by software.
0: CAN 1 clock disabled
1: CAN 1 clock enabled */

#define I2C3EN (1 << 23)
/* I2C3 clock enable
   Set and cleared by software.
0: I2C3 clock disabled
1: I2C3 clock enabled */

#define I2C2EN (1 << 22)
/* I2C2 clock enable
   Set and cleared by software.
0: I2C2 clock disabled
1: I2C2 clock enabled */

#define I2C1EN (1 << 21)
/* I2C1 clock enable
   Set and cleared by software.
0: I2C1 clock disabled
1: I2C1 clock enabled */

#define UART5EN (1 << 20)
/* UART5 clock enable
   Set and cleared by software.
0: UART5 clock disabled
1: UART5 clock enabled */

#define UART4EN (1 << 19)
/* UART4 clock enable
   Set and cleared by software.
0: UART4 clock disabled
1: UART4 clock enabled */

#define USART3EN (1 << 18)
/* USART3 clock enable
   Set and cleared by software.
0: USART3 clock disabled
1: USART3 clock enabled */

#define USART2EN (1 << 17)
/* USART 2 clock enable
   Set and cleared by software.
0: USART2 clock disabled
1: USART2 clock enabled */

#define SPI3EN (1 << 15)
/* SPI3 clock enable
   Set and cleared by software.
0: SPI3 clock disabled
1: SPI3 clock enabled */

#define SPI2EN (1 << 14)
/* SPI2 clock enable
   Set and cleared by software.
0: SPI2 clock disabled
1: SPI2 clock enabled */

#define WWDGEN (1 << 11)
/* Window watchdog clock enable
   Set and cleared by software.
0: Window watchdog clock disabled
1: Window watchdog clock enabled */

#define TIM14EN (1 << 8)
/* TIM14 clock enable
   Set and cleared by software.
0: TIM14 clock disabled
1: TIM14 clock enabled */

#define TIM13EN (1 << 7)
/* TIM13 clock enable
   Set and cleared by software.
0: TIM13 clock disabled
1: TIM13 clock enabled */

#define TIM12EN (1 << 6)
/* TIM12 clock enable
   Set and cleared by software.
0: TIM12 clock disabled
1: TIM12 clock enabled */

#define TIM7EN (1 << 5)
/* TIM7 clock enable
   Set and cleared by software.
0: TIM7 clock disabled
1: TIM7 clock enabled */

#define TIM6EN (1 << 4)
/* TIM6 clock enable
   Set and cleared by software.
0: TIM6 clock disabled
1: TIM6 clock enabled */

#define TIM5EN (1 << 3)
/* TIM5 clock enable
   Set and cleared by software.
0: TIM5 clock disabled
1: TIM5 clock enabled */

#define TIM4EN (1 << 2)
/* TIM4 clock enable
   Set and cleared by software.
0: TIM4 clock disabled
1: TIM4 clock enabled */

#define TIM3EN (1 << 1)
/* TIM3 clock enable
   Set and cleared by software.
0: TIM3 clock disabled
1: TIM3 clock enabled */

#define TIM2EN (1 << 0)
/* TIM2 clock enable
   Set and cleared by software.
0: TIM2 clock disabled
1: TIM2 clock enabled */

/* RCC APB2 peripheral clock enable register */
#define RCC_APB2ENR 0x44

#define TIM11EN (1 << 18)
/* TIM11 clock enable
   Set and cleared by software.
0: TIM11 clock disabled
1: TIM11 clock enabled */

#define TIM10EN (1 << 17)
/* TIM10 clock enable
   Set and cleared by software.
0: TIM10 clock disabled
1: TIM10 clock enabled */

#define TIM9EN (1 << 16)
/* TIM9 clock enable
   Set and cleared by software.
0: TIM9 clock disabled
1: TIM9 clock enabled */

#define SYSCFGEN (1 << 14)
/* System configuration controller clock enable
   Set and cleared by software.
0: System configuration controller clock disabled
1: System configuration controller clock enabled */

#define SPI1EN (1 << 12)
/* SPI1 clock enable
   Set and cleared by software.
0: SPI1 clock disabled
1: SPI1 clock enabled */

#define SDIOEN (1 << 11)
/* SDIO clock enable
   Set and cleared by software.
0: SDIO module clock disabled
1: SDIO module clock enabled */

#define ADC3EN (1 << 10)
/* ADC3 clock enable
   Set and cleared by software.
0: ADC3 clock disabled
1: ADC3 clock disabled
 */

#define ADC2EN (1 << 9)
/* ADC2 clock enable
   Set and cleared by software.
0: ADC2 clock disabled
1: ADC2 clock disabled */

#define ADC1EN (1 << 8)
/* ADC1 clock enable
   Set and cleared by software.
0: ADC1 clock disabled
1: ADC1 clock disabled
Bits 7:6
Reserved, always read as 0. */

#define USART6EN (1 << 5)
/* USART6 clock enable
   Set and cleared by software.
0: USART6 clock disabled
1: USART6 clock enabled */

#define USART1EN (1 << 4)
/* USART1 clock enable
   Set and cleared by software.
0: USART1 clock disabled
1: USART1 clock enabled
Bits 3:2
Reserved, always read as 0. */

#define TIM8EN (1 << 1)
/* TIM8 clock enable
   Set and cleared by software.
0: TIM8 clock disabled
1: TIM8 clock enabled */

#define TIM1EN (1 << 0)
/* TIM1 clock enable
   Set and cleared by software.
0: TIM1 clock disabled
1: TIM1 clock enabled */


/*-------------------------------------------------------------------------
  GPIO
  -------------------------------------------------------------------------*/

/* GPIO port mode register */
#define GPIO_MODER 0x00
#define MODE_INPUT(P) (0 << (2 * (P)))
#define MODE_OUTPUT(P) (1 << (2 * (P)))
#define MODE_ALT_FUNC(P) (2 << (2 * (P)))
#define MODE_ANALOG(P) (3 << (2 * (P)))

/* GPIO port output type register */
#define GPIO_OTYPER 0x04
#define PUSH_PULL(P) (0 << (P))
#define OPEN_DRAIN(P) (1 << (P))

/* GPIO port output speed register */
#define GPIO_OSPEEDR 0x08
#define OSPEEDR_LOW(P) (0 << (2 * (P)))
#define OSPEEDR_MED(P) (1 << (2 * (P)))
#define OSPEEDR_FAST(P) (2 << (2 * (P)))
#define OSPEEDR_HIGH(P) (3 << (2 * (P)))

/* GPIO alternate function low register */
#define GPIO_AFRL 0x20
#define AFRL(P, F) ((F) << (16 * (P)))

