bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
/* GPIO alternate function high register */
#define GPIO_AFRH 0x24
#define AFRH(P, F) ((F) << (16 * ((P) - 8)))

#define AF0 0
#define AF1 1
#define AF2 2
#define AF3 3
#define AF4 4
#define AF5 5
#define AF6 6
#define AF7 7
#define AF8 8
#define AF9 9
#define AF10 10
#define AF11 11
#define AF12 12
#define AF13 13
#define AF14 14
#define AF15 15

/*-------------------------------------------------------------------------
  Flash Interface
  -------------------------------------------------------------------------*/

/* Flash access control register */
#define FLASH_ACR 0x00
/*	The Flash access control register is used to enable/disable 
	the acceleration features and control the Flash memory access 
	time according to CPU frequency. */
#define RUN_PD (1 << 4)
#define SLEEP_PD (1 << 3)
#define ACC64 (1 << 2)
#define PRFTEN (1 << 1)
#define LATENCY (1 << 0)


/* Program/erase control register */
#define FLASH_PECR 0x04

/* Bit 18 OBL_LAUNCH: Launch the option byte loading */
#define OBL_LAUNCH ( 1<< 18)
/* This bit is set by software to launch the option byte loading. 
   This bit is cleared only when the option byte loading has completed. 
   It cannot be written if OPTLOCK is set. 
When this bit is set, a reset is generated.
0: Option byte loading complete
1: Option byte has to be loaded */

/* Bit 17 ERRIE: Error interrupt enable
0: interrupt disabled
1: interrupt enabled */

/* Bit 16 EOPIE: End of programming interrupt enable
0: interrupt disabled
1: interrupt enabled */

/* Bit 15 PARALLBANK: Parallel bank mode.
This bit can be set and cleared by software when no program or erase process is on-going.
When this bit is set, 2 half pages can be programmed or 2 pages can be erased in parallel
(the first one in the first bank and the second one in the second bank).
0: Parallel bank mode disabled
1: Parallel bank mode enabled
Note: This bit is available in Cat.4 and Cat.5 devices only. */

/* Bit 10 FPRG: Half Page/Double Word programming mode */
#define FPRG (1 << 10)
/* This bit can be written by software when no program or erase 
   process is ongoing.
   It is used to enable/disable Half Page Programming to the program 
   memory or Double Word Programming to the data EEPROM.
   32 loadings are required to program half a page to the program memory.
   2 loadings are required to program a double word to the data EEPROM.
   This bit is cleared when PELOCK is set.
0: Half Page/Double Word programming disabled
1: Half Page/Double Word programming enabled */

/* Bit 9 ERASE: Page or Double Word erase mode */
#define ERASE (1 << 9)
/* This bit can be written by software when no program or erase process is 
   on going. It is used to enable/disable Page Erase on the program memory or 
   Double Word Erase on the data EEPROM and the option byte block.
   This bit is cleared when PELOCK is set.
0: Page or Double Word Erase disabled
1: Page or Double Word Erase enabled */

/* Bit 8 FTDW: Fixed time data write for Byte, Half Word and Word programming */
#define FTDW (1 << 8)
/* This bit is writable by software when no program or erase process is 
   ongoing. This bit is used for the data EEPROM only.
   It is cleared when PELOCK is set.
   0: Programming of a Byte, Half Word or word is performed without any 
      previous erase operation. This is possible if the word being written 
	  to is 0x0000 0000.
   1: Before the programming of a Byte, Half Word and word an erase phase 
      is automatically performed. So the time of programming is fixed and 
	  lasts two t prog */

/* Bit 4 DATA: Data EEPROM selection */
#define DATA (1 << 4)
/* This bit is writable by software when no program or erase process is 
   ongoing. This bit has to be set prior to data EEPROM double word 
   erase/programming. 
   This bit is cleared when PELOCK is set.
0: Data EEPROM not selected
1: Data EEPROM selected */

/* Bit 3 PROG: Program memory selection */
#define PROG (1 << 3)
/* This bit is writable by software when no program or erase process is 
   ongoing. This bit has to be set to gain write access to the program 
   memory, except in the case of word programming.
This bit is cleared when PELOCK is set.
0: Program memory not selected
1: Program memory selected */

/* Bit 2 OPTLOCK: Option bytes block lock */
#define OPTLOCK (1 << 2)

/* This bit can only be written to 1. When it is set, it indicates that 
   the option byte block is locked.
   It is cleared by hardware after detecting the unlock sequence. In the 
   event of an unsuccessful unlock operation or a third access to 
   OPTKEYR, a bus error (Cortex ® -M3 hardfault or Busfault) is generated 
   and this bit remains set until the next reset. This bit is set when 
   PELOCK is set.
0: option unlocked
1: option locked */

/* Bit 1 PRGLOCK: Program memory lock */
#define PRGLOCK (1 << 1)
/* This bit can only be written to 1. When it is set, it indicates that 
   the program memory cannot be written. It is cleared by hardware after 
   detecting the unlock sequence. In the event of an unsuccessful unlock 
   operation or a third access to PRGKEYR, a bus error (Cortex ® -M3 
   hardfault or Busfault) is generated and this bit remains set until 
   the next reset.
This bit is set when PELOCK is set.
0: program memory unlocked
1: program memory locked */

/* Bit 0 PELOCK: FLASH_PECR and data EEPROM lock */
#define PELOCK (1 << 0)
/* This bit can only be written to 1. When it is set, it indicates that 
   the FLASH_PECR register and data EEPROM are locked. It is cleared by 
   hardware after detecting the unlock sequence. In the event of unsuccessful 
   unlock operation or a third access to PEKEYR, a bus error (Cortex ® -M3 
   hardfault or Busfault) is generated and this bit remains set until 
   the next reset. When this bit is cleared, write access to the 
   data EEPROM is allowed.
0: FLASH_PECR is unlocked
1: FLASH_PECR is locked */


/* ------------------------------------------------------------------------- */
/* Power down key register (FLASH_PDKEYR) */
#define FLASH_PDKEYR 0x08
/* The Power down key register is used to unlock 
   the RUN_PD bit in FLASH_ACR. */
#define PDKEY1 0x04152637
#define PDKEY2 0xfafbfcfd

/* Program/erase key register (FLASH_PEKEYR) */
#define FLASH_PEKEYR 0x0c
/* The Program/erase key register is used to allow access to FLASH_PECR 
   and so, to allow program and erase operations in the data EEPROM. */
#define PEKEY1 0x89abcdef
#define PEKEY2 0x02030405

/* Program memory key register (FLASH_PRGKEYR) */
#define FLASH_PRGKEYR 0x10
/*	The Program memory key register is used to allow program and erase 
	operations in the Program memory. It is write accessible only after 
	a correct write sequence has been executed in FLASH_PEKER */
#define PRGKEYR1 0x8c9daebf
#define PRGKEYR2 0x13141516

/* Option byte key register (FLASH_OPTKEYR) */
#define FLASH_OPTKEYR 0x14
/* The Option key register is used to allow program and erase operations 
   in the option byte block. It is write accessible only after the good 
   write sequence has been executed in FLASH_PEKEYR. */
#define OPTKEY1 0xfbead9c8
#define OPTKEY2 0x24252627

/* ------------------------------------------------------------------------- */
/* Flash status register */
#define FLASH_SR 0x18

