bobmittmann/yard-ice/src/targets/stm32f/stm32l_defs.h
/* Bit 13 RDERR: Read protected error */
#define RDERR (1 << 13)
/* Set by hardware when an address to be read through the Dbus belongs 
   to a read-protected (PCROP) part of the memory.
   Cleared by writing 1. */

/* Bit 12 OPTVERRUSR: Option UserValidity Error. */
#define OPTVERRUSR (1 << 12)
/* Set by hardware when the user options read may not be the ones 
   configured by the user.
   Cleared by writing 1.
   If option have not been properly loaded, each time there is a system 
   reset, OPTVERRUSR is set again. Consequently, an interrupt is 
   generated as soon as ERRIE is set.
   Note: This bit is available in Cat.3, Cat.4 and Cat.5 devices only. */

/* Bit 11 OPTVERR: Option validity error */
#define OPTVERR (1 << 11)
/* Set by hardware when the options read may not be the ones configured by 
   the software.
   Cleared by writing 1.
   If the options have not been properly loaded, each time a system reset 
   occurs, OPTVERR reverts to logical level 1. Consequently, an 
   interrupt is generated whenever ERRIE is set. */

/* Bit 10 SIZERR: Size error */
#define SIZERR (1 << 10)
/* Set by hardware when the size of the data to program is prohibited.
Cleared by writing it to 1. */

/* Bit 9 PGAERR: Programming alignment error */
#define PGAERR (1 << 9)
/* Set by hardware when the data to program cannot be contained in a 
   given half page or double word.
   Cleared by writing it to 1. */

/* Bit 8 WRPERR: Write protected error */
#define WRPERR (1 << 8)
/* Set by hardware when an address to be erased/programmed belongs to 
   a write-protected part of the memory.
   Cleared by writing it to 1. */

/* Bit 3 READY: Flash memory module ready after low power mode */
#define READY (1 << 3)
/* This bit is set and cleared by hardware.
0: Flash memory module is not ready
1: Flash memory module is ready */

/* Bit 2 ENDHV: End of high voltage */
#define ENDHV (1 << 2)
/* This bit is set and cleared by hardware.
0: High voltage still applied during write/erase operations
1: End of high voltage */

/* Bit 1 EOP: End of operation */
#define EOP (1 << 1)
/* This bit is set by hardware if the high voltage stops being applied 
   and programming has not been aborted. It is cleared by software 
   (by writing it to 1).
0: No EOP event occurred
1: An EOP event occured. An interrupt is generated if EOPIE is set */

/* Bit 0 BSY: Write/erase operations in progress */
#define BSY (1 << 0)
/* 0: Write/erase operation not in progress
1: Write/erase operation in progress */


/* Option byte register (FLASH_OBR) */
#define FLASH_OBR 0x1c
/*	Address offset: 0x1C 
	Reset value: depends on RDP and USER option byte, 
	on virgin part initial value is 0x00F80000 */

/* Bit 23 BFB2: Boot From Bank 2 */
#define BFB2 (1 << 23)
/* This bit contains the user option byte loaded by the OBL.
This bit is used to boot from Bank2 . Actually this bit indicates wether a boot from system
memory or from bank 1 has been selected by option programming. Then, the jump to Bank
1 or Bank 2 is done by software depending on the value of @08000000 and @08030000.
0: BOOT from system memory
1: BOOT from Bank 1
This bit is read only.
Note: This bit is available in Cat.4 and Cat.5 devices only.
*/

/* 
Bits 22:16 User option byte
These bits contain the user option byte loaded by the OBL.
Bit 22: nRST_STDBY
Bit 21: nRST_STOP
Bit 20: IWDG_SW */

/* Bits 19:16:BOR_LEV[3:0]: Brownout reset threshold level */ 
#define BOR_LEV (0xf << 16)
#define BOR_LEVEL_1 (0x8 << 16)
#define BOR_LEVEL_2 (0x9 << 16)
#define BOR_LEVEL_3 (0xa << 16)
#define BOR_LEVEL_4 (0xb << 16)
#define BOR_LEVEL_5 (0xc << 16)

/* 
0xxx: BOR OFF: Reset threshold level for the 1.45 V-1.55 V voltage range (power down
																		  only)
In this particular case, V DD33 must have been above BOR LEVEL 1 to start the device OBL
sequence in order to disable the BOR. The power-down is then monitored by the PDR.
Note: If the BOR is disabled, a “grey zone” exists between 1.65 V and the V PDR threshold
(this means that V DD33 may be below the minimum operating voltage (1.65 V) without
 causing a reset until it crosses the V PDR threshold)
1000: BOR LEVEL 1: Reset threshold level for 1.69 V-1.8 V voltage range (power on)
	1001: BOR LEVEL 2: Reset threshold level for 1.94 V-2.1 V voltage range (power on)
	1010: BOR LEVEL 3: Reset threshold level for 2.3 V-2.49 V voltage range (power on)
	1011: BOR LEVEL 4: Reset threshold level for 2.54 V-2.74 V voltage range (power on)
	1100: BOR LEVEL 5: Reset threshold level for 2.77 V-3.0 V voltage range (power on)
	These bits are read only.
*/

/* Bit 8 SPRMOD: Sector protection mode selection */
#define SPRMOD (1 << 8)
/* 0: WRP[i]=1 bit in FLASH_WRPRx registers defines sector write protection
   1: WRP[i]=0 bit in FLASH_WRPRx registers defines sector write and 
   read (PCROP) protection. 
   See Section 3.7.4: PCROP for details.
 */

/* Bits 7:0 RDPRT[7:0]: Read protection */
#define RDPRT 0xff
#define RDPRT_LEVEL0 0xaa
#define RDPRT_LEVEL1 0x00
#define RDPRT_LEVEL2 0xcc

/*	These bits contain the read protection option level loaded by the OBL.
	0xAA: Level 0, read protection not active
	0xCC: Level 2, read protection active
	Others: Level 1, read protection of memories active. 
	Default configuration after option byte erase. */


